Repository: flipper-hero/ios-app
Catalog: App/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, pl, pt_br, ru, tr, uk, zh_hans

source: Choose a model with tool calling. Images require vision support.
ar: اختر نموذجًا يدعم استدعاء الأدوات. تتطلب الصور دعم الرؤية.
de: Wähle ein Modell mit Werkzeugaufrufen. Für Bilder muss es Bildverarbeitung unterstützen.
es: Elige un modelo con llamadas a herramientas. Las imágenes requieren soporte de visión.
fr: Choisissez un modèle avec appel d’outils. Les images nécessitent la prise en charge de la vision.
hi: टूल कॉल वाला मॉडल चुनें। चित्रों के लिए दृष्टि समर्थन आवश्यक है।
it: Scegli un modello con chiamate agli strumenti. Le immagini richiedono supporto visivo.
ja: ツール呼び出しに対応したモデルを選んでください。画像には視覚機能が必要です。
ko: 도구 호출을 지원하는 모델을 선택하세요. 이미지에는 비전 지원이 필요합니다.
pl: Wybierz model obsługujący wywołania narzędzi. Obrazy wymagają obsługi wizji.
pt_br: Escolha um modelo com chamadas de ferramentas. Imagens exigem suporte visual.
ru: Выберите модель с вызовом инструментов. Для изображений нужна поддержка зрения.
tr: Araç çağrılarını destekleyen bir model seçin. Görseller için görüntü desteği gerekir.
uk: Виберіть модель із викликом інструментів. Для зображень потрібна підтримка зору.
zh_hans: 请选择支持工具调用的模型。图片需要视觉支持。

source: Provider
ar: المزوّد
de: Anbieter
es: Proveedor
fr: Fournisseur
hi: प्रदाता
it: Fornitore
ja: プロバイダー
ko: 제공업체
pl: Dostawca
pt_br: Provedor
ru: Провайдер
tr: Sağlayıcı
uk: Провайдер
zh_hans: 提供商

source: API key
ar: مفتاح API
de: API-Schlüssel
es: Clave API
fr: Clé API
hi: API कुंजी
it: Chiave API
ja: API キー
ko: API 키
pl: Klucz API
pt_br: Chave API
ru: Ключ API
tr: API anahtarı
uk: Ключ API
zh_hans: API 密钥

source: AI connection
ar: اتصال الذكاء الاصطناعي
de: KI-Verbindung
es: Conexión de IA
fr: Connexion IA
hi: AI कनेक्शन
it: Connessione IA
ja: AI 接続
ko: AI 연결
pl: Połączenie z AI
pt_br: Conexão de IA
ru: Подключение ИИ
tr: Yapay zekâ bağlantısı
uk: Підключення ШІ
zh_hans: AI 连接

source: Choose model
ar: اختيار النموذج
de: Modell auswählen
es: Elegir modelo
fr: Choisir un modèle
hi: मॉडल चुनें
it: Scegli modello
ja: モデルを選択
ko: 모델 선택
pl: Wybierz model
pt_br: Escolher modelo
ru: Выбрать модель
tr: Model seç
uk: Вибрати модель
zh_hans: 选择模型

source: Model ID
ar: معرّف النموذج
de: Modell-ID
es: ID del modelo
fr: Identifiant du modèle
hi: मॉडल ID
it: ID modello
ja: モデル ID
ko: 모델 ID
pl: ID modelu
pt_br: ID do modelo
ru: ID модели
tr: Model kimliği
uk: ID моделі
zh_hans: 模型 ID

source: API base URL
ar: عنوان API الأساسي
de: API-Basis-URL
es: URL base de la API
fr: URL de base de l’API
hi: API बेस URL
it: URL di base API
ja: API ベース URL
ko: API 기본 URL
pl: Bazowy adres URL API
pt_br: URL base da API
ru: Базовый URL API
tr: API temel URL’si
uk: Базова URL-адреса API
zh_hans: API 基础 URL

source: Provider documentation
ar: وثائق المزوّد
de: Dokumentation des Anbieters
es: Documentación del proveedor
fr: Documentation du fournisseur
hi: प्रदाता के दस्तावेज़
it: Documentazione del fornitore
ja: プロバイダーのドキュメント
ko: 제공업체 문서
pl: Dokumentacja dostawcy
pt_br: Documentação do provedor
ru: Документация провайдера
tr: Sağlayıcı belgeleri
uk: Документація провайдера
zh_hans: 提供商文档

source: Test and save
ar: اختبار وحفظ
de: Testen und speichern
es: Probar y guardar
fr: Tester et enregistrer
hi: जाँचें और सहेजें
it: Verifica e salva
ja: テストして保存
ko: 테스트 후 저장
pl: Przetestuj i zapisz
pt_br: Testar e salvar
ru: Проверить и сохранить
tr: Test et ve kaydet
uk: Перевірити й зберегти
zh_hans: 测试并保存

source: Testing connection…
ar: جارٍ اختبار الاتصال…
de: Verbindung wird getestet…
es: Probando conexión…
fr: Test de la connexion…
hi: कनेक्शन की जाँच हो रही है…
it: Verifica della connessione…
ja: 接続をテスト中…
ko: 연결 테스트 중…
pl: Testowanie połączenia…
pt_br: Testando conexão…
ru: Проверка подключения…
tr: Bağlantı test ediliyor…
uk: Перевірка підключення…
zh_hans: 正在测试连接…

source: Connection verified
ar: تم التحقق من الاتصال
de: Verbindung geprüft
es: Conexión verificada
fr: Connexion vérifiée
hi: कनेक्शन सत्यापित
it: Connessione verificata
ja: 接続を確認しました
ko: 연결 확인 완료
pl: Połączenie sprawdzone
pt_br: Conexão verificada
ru: Подключение проверено
tr: Bağlantı doğrulandı
uk: Підключення перевірено
zh_hans: 连接已验证

source: Loading models…
ar: جارٍ تحميل النماذج…
de: Modelle werden geladen…
es: Cargando modelos…
fr: Chargement des modèles…
hi: मॉडल लोड हो रहे हैं…
it: Caricamento modelli…
ja: モデルを読み込み中…
ko: 모델 로딩 중…
pl: Ładowanie modeli…
pt_br: Carregando modelos…
ru: Загрузка моделей…
tr: Modeller yükleniyor…
uk: Завантаження моделей…
zh_hans: 正在加载模型…

source: No matching models
ar: لا توجد نماذج مطابقة
de: Keine passenden Modelle
es: No hay modelos coincidentes
fr: Aucun modèle correspondant
hi: कोई मेल खाता मॉडल नहीं
it: Nessun modello corrispondente
ja: 一致するモデルはありません
ko: 일치하는 모델 없음
pl: Brak pasujących modeli
pt_br: Nenhum modelo correspondente
ru: Подходящих моделей нет
tr: Eşleşen model yok
uk: Відповідних моделей немає
zh_hans: 没有匹配的模型

source: Saving sends a short test message. Provider charges may apply. Each provider keeps its own key and model.
ar: يرسل الحفظ رسالة اختبار قصيرة. قد يفرض المزوّد رسومًا. يُحفظ مفتاح ونموذج منفصلان لكل مزوّد.
de: Beim Speichern wird eine kurze Testnachricht gesendet. Dabei können Kosten beim Anbieter entstehen. Jeder Anbieter behält seinen eigenen Schlüssel und sein Modell.
es: Al guardar se envía un breve mensaje de prueba. El proveedor puede cobrar por él. Cada proveedor conserva su propia clave y modelo.
fr: L’enregistrement envoie un court message de test. Le fournisseur peut le facturer. Chaque fournisseur conserve sa clé et son modèle.
hi: सहेजने पर एक छोटा परीक्षण संदेश भेजा जाता है। प्रदाता शुल्क ले सकता है। हर प्रदाता की अपनी कुंजी और मॉडल अलग सहेजे जाते हैं।
it: Il salvataggio invia un breve messaggio di prova. Il fornitore può addebitare costi. Ogni fornitore mantiene la propria chiave e il proprio modello.
ja: 保存時に短いテストメッセージを送信します。プロバイダーの料金が発生する場合があります。キーとモデルはプロバイダーごとに保存されます。
ko: 저장할 때 짧은 테스트 메시지를 보냅니다. 제공업체 요금이 발생할 수 있습니다. 키와 모델은 제공업체별로 저장됩니다.
pl: Zapis wysyła krótką wiadomość testową. Dostawca może naliczyć opłatę. Każdy dostawca zachowuje własny klucz i model.
pt_br: Ao salvar, uma breve mensagem de teste é enviada. O provedor pode cobrar por isso. Cada provedor mantém sua própria chave e modelo.
ru: При сохранении отправляется короткое тестовое сообщение. Провайдер может взимать плату. У каждого провайдера сохраняются свой ключ и модель.
tr: Kaydetme kısa bir test mesajı gönderir. Sağlayıcı ücret alabilir. Her sağlayıcı kendi anahtarını ve modelini saklar.
uk: Під час збереження надсилається коротке тестове повідомлення. Провайдер може стягувати плату. Для кожного провайдера зберігаються власні ключ і модель.
zh_hans: 保存时会发送一条简短的测试消息，提供商可能收费。每个提供商分别保存自己的密钥和模型。

source: Add your API key in Settings
ar: أضف مفتاح API في الإعدادات
de: Hinterlege deinen API-Schlüssel in den Einstellungen
es: Añade tu clave API en Ajustes
fr: Ajoute ta clé API dans les Réglages
hi: सेटिंग्स में अपनी API कुंजी जोड़ें
it: Aggiungi la tua chiave API nelle Impostazioni
ja: 設定で API キーを追加してください
ko: 설정에서 API 키를 추가하세요
pl: Dodaj klucz API w Ustawieniach
pt_br: Adicione sua chave API nos Ajustes
ru: Добавьте свой ключ API в настройках
tr: API anahtarını Ayarlar’a ekle
uk: Додайте свій ключ API у Параметрах
zh_hans: 请在设置中添加 API 密钥

source: %@ free
ar: %@ متاحة
de: %@ frei
es: %@ libres
fr: %@ libres
hi: %@ खाली
it: %@ liberi
ja: %@ 空き
ko: %@ 사용 가능
pl: Wolne %@
pt_br: %@ livres
ru: Свободно %@
tr: %@ boş
uk: Вільно %@
zh_hans: 可用 %@

# %@ free of %@
source: %1$@ free of %2$@
ar: %1$@ متاحة من %2$@
de: %1$@ von %2$@ frei
es: %1$@ libres de %2$@
fr: %1$@ libres sur %2$@
hi: %2$@ में से %1$@ खाली
it: %1$@ liberi su %2$@
ja: %2$@ 中 %1$@ 空き
ko: %2$@ 중 %1$@ 사용 가능
pl: Wolne %1$@ z %2$@
pt_br: %1$@ livres de %2$@
ru: Свободно %1$@ из %2$@
tr: %2$@ alanın %1$@ kadarı boş
uk: Вільно %1$@ із %2$@
zh_hans: %2$@ 中可用 %1$@

# %@ is at %@.
source: %1$@ is at %2$@.
ar: %1$@: البطارية عند %2$@.
de: %1$@: Akku bei %2$@.
es: %1$@: batería al %2$@.
fr: %1$@ : batterie à %2$@.
hi: %1$@: बैटरी %2$@ है।
it: %1$@: batteria al %2$@.
ja: %1$@：バッテリー %2$@。
ko: %1$@: 배터리 %2$@.
pl: %1$@: bateria %2$@.
pt_br: %1$@: bateria em %2$@.
ru: %1$@: заряд %2$@.
tr: %1$@: pil %2$@.
uk: %1$@: заряд %2$@.
zh_hans: %1$@：电量 %2$@。

# %@ on %@. Readers nearby see it until you stop.
source: %1$@ on %2$@. Readers nearby see it until you stop.
ar: %1$@ على %2$@. تراها القارئات القريبة حتى توقفها.
de: %1$@ auf %2$@. Läuft für Lesegeräte in der Nähe, bis du stoppst.
es: %1$@ en %2$@. Los lectores cercanos lo ven hasta que lo detengas.
fr: %1$@ sur %2$@. Visible par les lecteurs à proximité jusqu’à l’arrêt.
hi: %2$@ पर %1$@। आपके रोकने तक पास के रीडर इसे देखते हैं।
it: %1$@ su %2$@. I lettori vicini la vedono finché non la fermi.
ja: %2$@ で%1$@。停止するまで近くのリーダーから読み取れます。
ko: %2$@에서 %1$@. 중지할 때까지 주변 리더기가 읽을 수 있습니다.
pl: %1$@ na %2$@. Pobliskie czytniki widzą ją, dopóki nie zatrzymasz.
pt_br: %1$@ em %2$@. Leitores próximos a veem até você parar.
ru: %1$@ на %2$@. Видно ближайшим считывателям, пока вы не остановите.
tr: %2$@ üzerinde %1$@. Sen durdurana kadar yakındaki okuyucular görür.
uk: %1$@ на %2$@. Видно зчитувачам поруч, доки ви не зупините.
zh_hans: %2$@ 上的%1$@。在你停止前，附近的读卡器都能读到它。

source: (photo)
ar: (صورة)
de: (Foto)
es: (foto)
hi: (फ़ोटो)
it: (foto)
ja: （写真）
ko: (사진)
pl: (zdjęcie)
pt_br: (foto)
ru: (фото)
tr: (fotoğraf)
uk: (фото)
zh_hans: （照片）

source: 125 kHz tag
ar: وسم 125 كيلوهرتز
es: etiqueta de 125 kHz
fr: badge 125 kHz
hi: 125 kHz टैग
it: tag a 125 kHz
ja: 125 kHz タグ
ko: 125kHz 태그
pl: tag 125 kHz
pt_br: tag de 125 kHz
ru: метка 125 кГц
tr: 125 kHz etiket
uk: мітка 125 кГц
zh_hans: 125 kHz 标签

source: About 12 MB go over Bluetooth, which takes 15 to 25 minutes. Keep the phone close and the app open; the battery needs 30% or a charger. The Flipper restarts and finishes on its own.
ar: يُرسَل نحو 12 ميغابايت عبر البلوتوث، ويستغرق ذلك من 15 إلى 25 دقيقة. أبقِ الهاتف قريبًا والتطبيق مفتوحًا؛ تحتاج البطارية إلى 30٪ أو شاحن. يعيد Flipper التشغيل ويُكمل بنفسه.
de: Etwa 12 MB gehen per Bluetooth rüber, das dauert 15 bis 25 Minuten. Lass das Telefon in der Nähe und die App offen; der Akku braucht 30 % oder ein Ladegerät. Der Flipper startet neu und schließt das Update selbst ab.
es: Se envían unos 12 MB por Bluetooth, lo que tarda de 15 a 25 minutos. Mantén el teléfono cerca y la app abierta; la batería necesita un 30 % o un cargador. El Flipper se reinicia y termina por sí solo.
fr: Environ 12 Mo passent par Bluetooth, ce qui prend 15 à 25 minutes. Garde le téléphone à proximité et l’app ouverte ; la batterie doit être à 30 % ou sur secteur. Le Flipper redémarre et termine tout seul.
hi: लगभग 12 MB ब्लूटूथ से जाता है, जिसमें 15 से 25 मिनट लगते हैं। फ़ोन पास रखें और ऐप खुला रखें; बैटरी 30% या चार्जर पर होनी चाहिए। Flipper रीस्टार्ट होकर खुद पूरा करता है।
it: Circa 12 MB passano via Bluetooth, servono dai 15 ai 25 minuti. Tieni il telefono vicino e l’app aperta; la batteria deve essere al 30% o in carica. Il Flipper si riavvia e completa da solo.
ja: 約 12 MB を Bluetooth で転送するため、15〜25 分かかります。iPhone を近くに置き、アプリを開いたままにしてください。バッテリーは 30% 以上か充電中である必要があります。Flipper は再起動して自動で完了します。
ko: 약 12MB를 블루투스로 전송하며 15~25분이 걸립니다. 휴대폰을 가까이 두고 앱을 열어 두세요. 배터리가 30% 이상이거나 충전 중이어야 합니다. Flipper가 재시동한 뒤 알아서 마무리합니다.
pl: Około 12 MB trafia przez Bluetooth, co zajmuje 15–25 minut. Trzymaj telefon blisko i aplikację otwartą; bateria musi mieć 30% lub ładowarkę. Flipper uruchomi się ponownie i dokończy sam.
pt_br: Cerca de 12 MB vão por Bluetooth, o que leva de 15 a 25 minutos. Mantenha o celular por perto e o app aberto; a bateria precisa de 30% ou de um carregador. O Flipper reinicia e conclui sozinho.
ru: По Bluetooth передаётся около 12 МБ, это занимает 15–25 минут. Держите телефон рядом и приложение открытым; нужен заряд от 30% или зарядка. Flipper перезагрузится и завершит обновление сам.
tr: Bluetooth üzerinden yaklaşık 12 MB gönderilir, bu 15 ila 25 dakika sürer. Telefonu yakında ve uygulamayı açık tut; pilin %30 olması ya da şarjda olması gerekir. Flipper yeniden başlar ve kendisi tamamlar.
uk: Через Bluetooth передається приблизно 12 МБ, це триває 15–25 хвилин. Тримайте телефон поруч і застосунок відкритим; потрібен заряд від 30% або зарядний пристрій. Flipper перезапуститься й завершить оновлення сам.
zh_hans: 约 12 MB 数据将通过蓝牙传输，需要 15 到 25 分钟。请让手机靠近并保持 App 打开；电量需要 30% 或接上充电器。Flipper 会重启并自行完成更新。

source: Agent
ar: الوكيل
es: Agente
hi: एजेंट
it: Agente
ja: エージェント
ko: 에이전트
pt_br: Agente
ru: Агент
tr: Ajan
uk: Агент
zh_hans: 智能体

source: Allow permission change?
ar: السماح بتغيير الأذونات؟
de: Berechtigungsänderung erlauben?
es: ¿Permitir el cambio de permisos?
fr: Autoriser le changement de permissions ?
hi: अनुमति में बदलाव की इजाज़त दें?
it: Consentire la modifica dei permessi?
ja: 権限の変更を許可しますか？
ko: 권한 변경을 허용할까요?
pl: Zezwolić na zmianę uprawnień?
pt_br: Permitir mudança de permissão?
ru: Разрешить изменение прав?
tr: İzin değişikliğine izin verilsin mi?
uk: Дозволити зміну дозволів?
zh_hans: 允许更改权限？

source: Approvals
ar: الموافقات
de: Freigaben
es: Aprobaciones
fr: Approbations
hi: स्वीकृतियाँ
it: Approvazioni
ja: 承認
ko: 승인
pl: Zatwierdzenia
pt_br: Aprovações
ru: Подтверждения
tr: Onaylar
uk: Підтвердження
zh_hans: 审批

source: Approve
ar: موافقة
de: Freigeben
es: Aprobar
fr: Approuver
hi: स्वीकार करें
it: Approva
ja: 承認
ko: 승인
pl: Zatwierdź
pt_br: Aprovar
ru: Подтвердить
tr: Onayla
uk: Підтвердити
zh_hans: 批准

source: Approve action
ar: الموافقة على الإجراء
de: Aktion freigeben
es: Aprobar acción
fr: Approuver l’action
hi: कार्रवाई स्वीकार करें
it: Approva azione
ja: 操作を承認
ko: 작업 승인
pl: Zatwierdź działanie
pt_br: Aprovar ação
ru: Подтвердить действие
tr: İşlemi onayla
uk: Підтвердити дію
zh_hans: 批准操作

source: Arm engagement mode...
ar: تفعيل وضع الـ Engagement...
de: Engagement-Modus aktivieren...
es: Activar el modo engagement...
fr: Armer le mode engagement...
hi: एंगेजमेंट मोड चालू करें...
it: Attiva la modalità engagement...
ja: エンゲージメントモードを有効に...
ko: Engagement 모드 활성화...
pl: Aktywuj tryb engagement...
pt_br: Ativar o modo engagement...
ru: Включить режим engagement...
tr: Engagement modunu etkinleştir...
uk: Увімкнути режим engagement...
zh_hans: 启用 Engagement 模式...

source: Armed (%@)
ar: مفعّل (%@)
de: Aktiv (%@)
es: Activado (%@)
fr: Armé (%@)
hi: सक्रिय (%@)
it: Attivo (%@)
ja: 有効（%@）
ko: 활성화됨(%@)
pl: Aktywny (%@)
pt_br: Ativado (%@)
ru: Активен (%@)
tr: Etkin (%@)
uk: Активно (%@)
zh_hans: 已启用（%@）

source: Ask FlipperHero
ar: اسأل FlipperHero
de: FlipperHero fragen
es: Preguntar a FlipperHero
fr: Demander à FlipperHero
hi: FlipperHero से पूछें
it: Chiedi a FlipperHero
ja: FlipperHero に聞く
ko: FlipperHero에게 묻기
pl: Zapytaj FlipperHero
pt_br: Perguntar ao FlipperHero
ru: Спросить FlipperHero
tr: FlipperHero’ya sor
uk: Запитати FlipperHero
zh_hans: 询问 FlipperHero

source: Ask about your Flipper...
ar: اسأل عن Flipper الخاص بك...
de: Frag etwas zu deinem Flipper...
es: Pregunta sobre tu Flipper...
fr: Pose une question sur ton Flipper...
hi: अपने Flipper के बारे में पूछें...
it: Chiedi qualcosa sul tuo Flipper...
ja: Flipper について質問...
ko: Flipper에 대해 물어보세요...
pl: Zapytaj o swojego Flippera...
pt_br: Pergunte sobre o seu Flipper...
ru: Спросите о вашем Flipper...
tr: Flipper’ın hakkında sor...
uk: Запитайте про свій Flipper...
zh_hans: 问问你的 Flipper...

source: Ask the Agent
ar: اسأل الوكيل
de: Agent fragen
es: Preguntar al agente
fr: Demander à l’agent
hi: एजेंट से पूछें
it: Chiedi all’agente
ja: エージェントに聞く
ko: 에이전트에게 묻기
pl: Zapytaj agenta
pt_br: Perguntar ao agente
ru: Спросить агента
tr: Ajana sor
uk: Запитати агента
zh_hans: 询问智能体

source: At most %lld characters: letters, digits, hyphen, underscore. It takes effect after the Flipper restarts.
ar: %lld أحرف كحد أقصى: حروف وأرقام وشرطة وشرطة سفلية. يسري بعد إعادة تشغيل Flipper.
de: Höchstens %lld Zeichen: Buchstaben, Ziffern, Bindestrich, Unterstrich. Gilt nach einem Neustart des Flippers.
es: Como máximo %lld caracteres: letras, dígitos, guion y guion bajo. Se aplica tras reiniciar el Flipper.
fr: %lld caractères maximum : lettres, chiffres, tiret, tiret bas. Pris en compte après le redémarrage du Flipper.
hi: अधिकतम %lld अक्षर: अक्षर, अंक, हाइफ़न, अंडरस्कोर। Flipper रीस्टार्ट होने के बाद लागू होता है।
it: Al massimo %lld caratteri: lettere, cifre, trattino, trattino basso. Vale dopo il riavvio del Flipper.
ja: 最大 %lld 文字：英字、数字、ハイフン、アンダースコア。Flipper の再起動後に反映されます。
ko: 최대 %lld자: 영문자, 숫자, 하이픈, 밑줄. Flipper를 재시동하면 적용됩니다.
pl: Najwyżej %lld znaków: litery, cyfry, myślnik, podkreślnik. Obowiązuje po ponownym uruchomieniu Flippera.
pt_br: No máximo %lld caracteres: letras, dígitos, hífen, sublinhado. Vale após reiniciar o Flipper.
ru: Не более %lld символов: буквы, цифры, дефис, подчёркивание. Применяется после перезагрузки Flipper.
tr: En fazla %lld karakter: harf, rakam, kısa çizgi, alt çizgi. Flipper yeniden başlayınca geçerli olur.
uk: Не більше %lld символів: літери, цифри, дефіс, підкреслення. Діє після перезапуску Flipper.
zh_hans: 最多 %lld 个字符：字母、数字、连字符、下划线。Flipper 重启后生效。

source: Audit log
ar: سجل التدقيق
de: Protokoll
es: Registro de auditoría
fr: Journal d’audit
hi: ऑडिट लॉग
it: Registro di controllo
ja: 監査ログ
ko: 감사 로그
pl: Dziennik działań
pt_br: Registro de auditoria
ru: Журнал действий
tr: Denetim kaydı
uk: Журнал дій
zh_hans: 审计日志

source: Battery
ar: البطارية
de: Akku
es: Batería
fr: Batterie
hi: बैटरी
it: Batteria
ja: バッテリー
ko: 배터리
pl: Bateria
pt_br: Bateria
ru: Батарея
tr: Pil
uk: Акумулятор
zh_hans: 电池

source: Binary file, %lld bytes.
ar: ملف ثنائي، %lld بايت.
de: Binärdatei, %lld Bytes.
es: Archivo binario, %lld bytes.
fr: Fichier binaire, %lld octets.
hi: बाइनरी फ़ाइल, %lld बाइट।
it: File binario, %lld byte.
ja: バイナリファイル、%lld バイト。
ko: 바이너리 파일, %lld바이트.
pl: Plik binarny, %lld B.
pt_br: Arquivo binário, %lld bytes.
ru: Двоичный файл, %lld байт.
tr: İkili dosya, %lld bayt.
uk: Двійковий файл, %lld байтів.
zh_hans: 二进制文件，%lld 字节。

source: Bluetooth is not supported
ar: البلوتوث غير مدعوم
de: Bluetooth wird nicht unterstützt
es: Bluetooth no es compatible
fr: Bluetooth n’est pas pris en charge
hi: ब्लूटूथ समर्थित नहीं है
it: Bluetooth non supportato
ja: Bluetooth に対応していません
ko: 블루투스를 지원하지 않습니다
pl: Bluetooth nie jest obsługiwany
pt_br: O Bluetooth não é compatível
ru: Bluetooth не поддерживается
tr: Bluetooth desteklenmiyor
uk: Bluetooth не підтримується
zh_hans: 不支持蓝牙

source: Bluetooth is off
ar: البلوتوث مطفأ
de: Bluetooth ist aus
es: Bluetooth está desactivado
fr: Bluetooth est désactivé
hi: ब्लूटूथ बंद है
it: Il Bluetooth è spento
ja: Bluetooth がオフです
ko: 블루투스가 꺼져 있습니다
pl: Bluetooth jest wyłączony
pt_br: O Bluetooth está desligado
ru: Bluetooth выключен
tr: Bluetooth kapalı
uk: Bluetooth вимкнено
zh_hans: 蓝牙已关闭

source: Bluetooth permission denied. Enable it in iOS Settings.
ar: تم رفض إذن البلوتوث. فعّله في إعدادات iOS.
de: Bluetooth-Zugriff verweigert. Aktiviere ihn in den iOS-Einstellungen.
es: Permiso de Bluetooth denegado. Actívalo en los Ajustes de iOS.
fr: Accès Bluetooth refusé. Active-le dans les Réglages iOS.
hi: ब्लूटूथ की अनुमति नहीं मिली। iOS सेटिंग्स में चालू करें।
it: Permesso Bluetooth negato. Attivalo nelle Impostazioni di iOS.
ja: Bluetooth へのアクセスが拒否されました。iOS の設定で許可してください。
ko: 블루투스 권한이 거부되었습니다. iOS 설정에서 허용하세요.
pl: Odmówiono dostępu do Bluetooth. Włącz go w Ustawieniach iOS.
pt_br: Permissão de Bluetooth negada. Ative nos Ajustes do iOS.
ru: Доступ к Bluetooth запрещён. Включите его в настройках iOS.
tr: Bluetooth izni reddedildi. iOS Ayarları’ndan aç.
uk: Доступ до Bluetooth заборонено. Увімкніть його в Параметрах iOS.
zh_hans: 蓝牙权限被拒绝。请在 iOS 设置中开启。

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करें
it: Annulla
ja: キャンセル
ko: 취소
pl: Anuluj
pt_br: Cancelar
ru: Отмена
tr: Vazgeç
uk: Скасувати
zh_hans: 取消

source: Cancel Flipper Firmware Update
ar: إلغاء تحديث برنامج Flipper الثابت
de: Flipper-Firmware-Update abbrechen
es: Cancelar actualización de firmware del Flipper
fr: Annuler la mise à jour du firmware du Flipper
hi: Flipper फ़र्मवेयर अपडेट रद्द करें
it: Annulla aggiornamento firmware del Flipper
ja: Flipper のファームウェア更新をキャンセル
ko: Flipper 펌웨어 업데이트 취소
pl: Anuluj aktualizację firmware’u Flippera
pt_br: Cancelar atualização de firmware do Flipper
ru: Отменить обновление прошивки Flipper
tr: Flipper aygıt yazılımı güncellemesini iptal et
uk: Скасувати оновлення прошивки Flipper
zh_hans: 取消 Flipper 固件更新

source: Cancel update
ar: إلغاء التحديث
de: Update abbrechen
es: Cancelar actualización
fr: Annuler la mise à jour
hi: अपडेट रद्द करें
it: Annulla aggiornamento
ja: 更新をキャンセル
ko: 업데이트 취소
pl: Anuluj aktualizację
pt_br: Cancelar atualização
ru: Отменить обновление
tr: Güncellemeyi iptal et
uk: Скасувати оновлення
zh_hans: 取消更新

source: Cancelled the update to %@. Nothing was installed.
ar: أُلغي التحديث إلى %@. لم يُثبَّت أي شيء.
de: Update auf %@ abgebrochen. Es wurde nichts installiert.
es: Se canceló la actualización a %@. No se instaló nada.
fr: Mise à jour vers %@ annulée. Rien n’a été installé.
hi: %@ का अपडेट रद्द किया गया। कुछ भी इंस्टॉल नहीं हुआ।
it: Aggiornamento a %@ annullato. Non è stato installato nulla.
ja: %@ への更新をキャンセルしました。何もインストールされていません。
ko: %@(으)로의 업데이트를 취소했습니다. 아무것도 설치되지 않았습니다.
pl: Anulowano aktualizację do %@. Nic nie zostało zainstalowane.
pt_br: Atualização para %@ cancelada. Nada foi instalado.
ru: Обновление до %@ отменено. Ничего не установлено.
tr: %@ güncellemesi iptal edildi. Hiçbir şey yüklenmedi.
uk: Оновлення до %@ скасовано. Нічого не встановлено.
zh_hans: 已取消更新到 %@。未安装任何内容。

source: Cancelled.
ar: أُلغي.
de: Abgebrochen.
es: Cancelado.
fr: Annulé.
hi: रद्द किया गया।
it: Annullato.
ja: キャンセルしました。
ko: 취소했습니다.
pl: Anulowano.
pt_br: Cancelado.
ru: Отменено.
tr: İptal edildi.
uk: Скасовано.
zh_hans: 已取消。

source: Cancels a firmware update before it is installed.
ar: يلغي تحديث البرنامج الثابت قبل تثبيته.
de: Bricht ein Firmware-Update ab, bevor es installiert wird.
es: Cancela una actualización de firmware antes de instalarla.
fr: Annule une mise à jour du firmware avant son installation.
hi: फ़र्मवेयर अपडेट को इंस्टॉल होने से पहले रद्द करता है।
it: Annulla un aggiornamento firmware prima che venga installato.
ja: インストール前にファームウェア更新をキャンセルします。
ko: 설치되기 전에 펌웨어 업데이트를 취소합니다.
pl: Anuluje aktualizację firmware’u przed instalacją.
pt_br: Cancela uma atualização de firmware antes de ser instalada.
ru: Отменяет обновление прошивки до его установки.
tr: Aygıt yazılımı güncellemesini yüklenmeden önce iptal eder.
uk: Скасовує оновлення прошивки до його встановлення.
zh_hans: 在安装前取消固件更新。

source: Capabilities
ar: القدرات
de: Fähigkeiten
es: Capacidades
fr: Capacités
hi: क्षमताएँ
it: Capacità
ja: 機能
ko: 기능
pl: Możliwości
pt_br: Capacidades
ru: Возможности
tr: Yetenekler
uk: Можливості
zh_hans: 能力

source: Card or Key
ar: بطاقة أو مفتاح
de: Karte oder Schlüssel
es: Tarjeta o llave
fr: Carte ou clé
hi: कार्ड या कुंजी
it: Carta o chiave
ja: カードまたはキー
ko: 카드 또는 키
pl: Karta lub klucz
pt_br: Cartão ou chave
ru: Карта или ключ
tr: Kart veya anahtar
uk: Картка або ключ
zh_hans: 卡片或钥匙

source: Card or key
ar: بطاقة أو مفتاح
de: Karte oder Schlüssel
es: Tarjeta o llave
fr: Carte ou clé
hi: कार्ड या कुंजी
it: Carta o chiave
ja: カードまたはキー
ko: 카드 또는 키
pl: Karta lub klucz
pt_br: Cartão ou chave
ru: Карта или ключ
tr: Kart veya anahtar
uk: Картка або ключ
zh_hans: 卡片或钥匙

source: Checking the Flipper before installing %@
ar: جارٍ فحص Flipper قبل تثبيت %@
de: Prüfe den Flipper vor der Installation von %@
es: Comprobando el Flipper antes de instalar %@
fr: Vérification du Flipper avant l’installation de %@
hi: %@ इंस्टॉल करने से पहले Flipper की जाँच हो रही है
it: Controllo del Flipper prima di installare %@
ja: %@ をインストールする前に Flipper を確認中
ko: %@ 설치 전 Flipper 확인 중
pl: Sprawdzanie Flippera przed instalacją %@
pt_br: Verificando o Flipper antes de instalar %@
ru: Проверка Flipper перед установкой %@
tr: %@ yüklenmeden önce Flipper denetleniyor
uk: Перевірка Flipper перед встановленням %@
zh_hans: 安装 %@ 前正在检查 Flipper
